GrumpyOldPizza/ArduinoCore-stm32l0/boards.txt
RHF76-052.menu.speed.32=32 MHz
RHF76-052.menu.speed.32.build.f_cpu=32000000L
RHF76-052.menu.speed.16=16 MHz
RHF76-052.menu.speed.16.build.f_cpu=16000000L
RHF76-052.menu.speed.4=4.2 MHz
RHF76-052.menu.speed.4.build.f_cpu=4200000L

RHF76-052.menu.opt.os=Smallest Code
RHF76-052.menu.opt.os.build.flags.optimize=-Os
RHF76-052.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
RHF76-052.menu.opt.o1=Fast
RHF76-052.menu.opt.o1.build.flags.optimize=-O1
RHF76-052.menu.opt.o1.build.flags.ldspecs=
RHF76-052.menu.opt.o2=Faster
RHF76-052.menu.opt.o2.build.flags.optimize=-O2
RHF76-052.menu.opt.o2.build.flags.ldspecs=
RHF76-052.menu.opt.o3=Fastest
RHF76-052.menu.opt.o3.build.flags.optimize=-O3
RHF76-052.menu.opt.o3.build.flags.ldspecs=

# Murata CMWX1ZZABZ w/STM32L072CZ @ STLINK
# ---------------------------------------
CMWX1ZZABZ-STLINK.name=CMWX1ZZABZ-STLINK
CMWX1ZZABZ-STLINK.vid.0=0x0483
CMWX1ZZABZ-STLINK.pid.0=0x374b

CMWX1ZZABZ-STLINK.upload.tool=stm32l0_openocd
CMWX1ZZABZ-STLINK.upload.protocol=stlink
CMWX1ZZABZ-STLINK.upload.maximum_size=196608
CMWX1ZZABZ-STLINK.upload.maximum_data_size=20480
CMWX1ZZABZ-STLINK.upload.use_1200bps_touch=true
CMWX1ZZABZ-STLINK.upload.wait_for_upload_port=false
CMWX1ZZABZ-STLINK.upload.native_usb=false

CMWX1ZZABZ-STLINK.build.mcu=cortex-m0plus
CMWX1ZZABZ-STLINK.build.f_cpu=32000000L
CMWX1ZZABZ-STLINK.build.board=CMWX1ZZABZ_STLINK
CMWX1ZZABZ-STLINK.build.arch=stm32l0
CMWX1ZZABZ-STLINK.build.core=arduino
CMWX1ZZABZ-STLINK.build.vid=0x0483
CMWX1ZZABZ-STLINK.build.pid=0x374b
CMWX1ZZABZ-STLINK.build.did=0xffff
CMWX1ZZABZ-STLINK.build.extra_flags=-DSTM32L072xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant
CMWX1ZZABZ-STLINK.build.ldscript=linker_scripts/STM32L072CZ_FLASH.ld
CMWX1ZZABZ-STLINK.build.openocdscript=openocd_scripts/b-l072z-lrwan1.cfg
CMWX1ZZABZ-STLINK.build.variant=CMWX1ZZABZ-STLINK
CMWX1ZZABZ-STLINK.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l072xx -larm_cortexM0l_math
CMWX1ZZABZ-STLINK.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

CMWX1ZZABZ-STLINK.menu.speed.32=32 MHz
CMWX1ZZABZ-STLINK.menu.speed.32.build.f_cpu=32000000L
CMWX1ZZABZ-STLINK.menu.speed.16=16 MHz (No USB)
CMWX1ZZABZ-STLINK.menu.speed.16.build.f_cpu=16000000L
CMWX1ZZABZ-STLINK.menu.speed.4=4.2 MHz (No USB)
CMWX1ZZABZ-STLINK.menu.speed.4.build.f_cpu=4200000L

CMWX1ZZABZ-STLINK.menu.opt.os=Smallest Code
CMWX1ZZABZ-STLINK.menu.opt.os.build.flags.optimize=-Os
CMWX1ZZABZ-STLINK.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
CMWX1ZZABZ-STLINK.menu.opt.o1=Fast
CMWX1ZZABZ-STLINK.menu.opt.o1.build.flags.optimize=-O1
CMWX1ZZABZ-STLINK.menu.opt.o1.build.flags.ldspecs=
CMWX1ZZABZ-STLINK.menu.opt.o2=Faster
CMWX1ZZABZ-STLINK.menu.opt.o2.build.flags.optimize=-O2
CMWX1ZZABZ-STLINK.menu.opt.o2.build.flags.ldspecs=
CMWX1ZZABZ-STLINK.menu.opt.o3=Fastest
CMWX1ZZABZ-STLINK.menu.opt.o3.build.flags.optimize=-O3
CMWX1ZZABZ-STLINK.menu.opt.o3.build.flags.ldspecs=

# Murata CMWX1ZZABZ w/STM32L072CZ @ USB
# ---------------------------------------
CMWX1ZZABZ-USB.name=CMWX1ZZABZ-USB
CMWX1ZZABZ-USB.vid.0=0x0483
CMWX1ZZABZ-USB.pid.0=0x374b

CMWX1ZZABZ-USB.upload.tool=stm32l0_dfu
CMWX1ZZABZ-USB.upload.protocol=dfu
CMWX1ZZABZ-USB.upload.maximum_size=196608
CMWX1ZZABZ-USB.upload.maximum_data_size=20480
CMWX1ZZABZ-USB.upload.use_1200bps_touch=true
CMWX1ZZABZ-USB.upload.wait_for_upload_port=false
CMWX1ZZABZ-USB.upload.native_usb=false

CMWX1ZZABZ-USB.build.mcu=cortex-m0plus
CMWX1ZZABZ-USB.build.f_cpu=32000000L
CMWX1ZZABZ-USB.build.board=CMWX1ZZABZ_USB
CMWX1ZZABZ-USB.build.arch=stm32l0
CMWX1ZZABZ-USB.build.core=arduino
CMWX1ZZABZ-USB.build.vid=0x0483
CMWX1ZZABZ-USB.build.pid=0x374b
CMWX1ZZABZ-USB.build.did=0xffff
CMWX1ZZABZ-USB.build.usb_manufacturer="Murata"
CMWX1ZZABZ-USB.build.usb_product="CMWX1ZZABZ"
CMWX1ZZABZ-USB.build.extra_flags=-DSTM32L082xx -march=armv6-m -mthumb -mabi=aapcs -mfloat-abi=soft -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
CMWX1ZZABZ-USB.build.ldscript=linker_scripts/STM32L082CZ_FLASH.ld
CMWX1ZZABZ-USB.build.openocdscript=openocd_scripts/CMWX1ZZABZ-USB.cfg
CMWX1ZZABZ-USB.build.variant=CMWX1ZZABZ-USB
CMWX1ZZABZ-USB.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L0xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l082xx -larm_cortexM0l_math
CMWX1ZZABZ-USB.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L0xx/Include" "-I{runtime.platform.path}/system/STM32L0xx/Include" 

CMWX1ZZABZ-USB.menu.usb.cdc=Serial
CMWX1ZZABZ-USB.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
CMWX1ZZABZ-USB.menu.usb.cdc_msc=Serial + Mass Storage
CMWX1ZZABZ-USB.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
CMWX1ZZABZ-USB.menu.usb.cdc_hid=Serial + Keyboard + Mouse
CMWX1ZZABZ-USB.menu.usb.cdc_hid.build.usb_type=USB_TYPE_CDC_HID
CMWX1ZZABZ-USB.menu.usb.cdc_msc_hid=Serial + Mass Storage + Keyboard + Mouse
CMWX1ZZABZ-USB.menu.usb.cdc_msc_hid.build.usb_type=USB_TYPE_CDC_MSC_HID
CMWX1ZZABZ-USB.menu.usb.none=No USB
CMWX1ZZABZ-USB.menu.usb.none.build.usb_type=USB_TYPE_NONE

CMWX1ZZABZ-USB.menu.dosfs.none=None
CMWX1ZZABZ-USB.menu.dosfs.none.build.dosfs_sdcard=0
CMWX1ZZABZ-USB.menu.dosfs.none.build.dosfs_sflash=0
CMWX1ZZABZ-USB.menu.dosfs.sdspi=SDCARD (SPI1)
CMWX1ZZABZ-USB.menu.dosfs.sdspi.build.dosfs_sdcard=1
CMWX1ZZABZ-USB.menu.dosfs.sdspi.build.dosfs_sflash=0
CMWX1ZZABZ-USB.menu.dosfs.sfspi=SFLASH (SPI1)
CMWX1ZZABZ-USB.menu.dosfs.sfspi.build.dosfs_sdcard=0
CMWX1ZZABZ-USB.menu.dosfs.sfspi.build.dosfs_sflash=1

CMWX1ZZABZ-USB.menu.speed.32=32 MHz
CMWX1ZZABZ-USB.menu.speed.32.build.f_cpu=32000000L
CMWX1ZZABZ-USB.menu.speed.16=16 MHz (No USB)
CMWX1ZZABZ-USB.menu.speed.16.build.f_cpu=16000000L
CMWX1ZZABZ-USB.menu.speed.4=4.2 MHz (No USB)
CMWX1ZZABZ-USB.menu.speed.4.build.f_cpu=4200000L

CMWX1ZZABZ-USB.menu.opt.os=Smallest Code
CMWX1ZZABZ-USB.menu.opt.os.build.flags.optimize=-Os
CMWX1ZZABZ-USB.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
CMWX1ZZABZ-USB.menu.opt.o1=Fast
CMWX1ZZABZ-USB.menu.opt.o1.build.flags.optimize=-O1
CMWX1ZZABZ-USB.menu.opt.o1.build.flags.ldspecs=
CMWX1ZZABZ-USB.menu.opt.o2=Faster
CMWX1ZZABZ-USB.menu.opt.o2.build.flags.optimize=-O2
CMWX1ZZABZ-USB.menu.opt.o2.build.flags.ldspecs=
CMWX1ZZABZ-USB.menu.opt.o3=Fastest
CMWX1ZZABZ-USB.menu.opt.o3.build.flags.optimize=-O3
CMWX1ZZABZ-USB.menu.opt.o3.build.flags.ldspecs=